{
  "backend/main.mo": "Main backend actor implementing access control, user profiles (basic and extended), blob storage, workout programs, gyms, bookings, donations, gallery, likes, body shape analysis, fitness metrics, and lifestyle surveys with role-based authorization.",
  "feature_evidence.json": "Feature evidence report documenting a single feature to update muscle mass estimation text color in BodyAnalysisPage.tsx for consistent styling across result metrics.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks including routing, admin tabs, user profiles, booking flow, payment processing, and body analysis features.",
  "frontend/index.html": "HTML entry point for SuperWorkout application with meta tags for description and viewport configuration.",
  "frontend/public/.well-known/ic-domains": "Internet Computer domain configuration file specifying superworkout.net as the custom domain.",
  "frontend/public/.well-known/ii-alternative-origins": "Internet Identity alternative origins configuration allowing authentication from superworkout.net domain.",
  "frontend/src/.well-known/ic-domains": "Empty IC domains configuration file in the src directory.",
  "frontend/src/.well-known/ii-alternative-origins": "Empty Internet Identity alternative origins configuration file in the src directory.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, booking, donation, admin, profile, about, fitness metrics, lifestyle survey, body analysis, payment success/failure), QueryClient, ThemeProvider, and Toaster.",
  "frontend/src/components/admin/AboutMeTab.tsx": "Admin tab for managing coach profile content including a text editor for 'About Me' description and profile picture upload with progress tracking. Uses ExternalBlob for image handling and displays avatar preview.",
  "frontend/src/components/admin/AvailabilityTab.tsx": "Admin interface for managing coach availability with a calendar date picker and time slot list (08:00-21:00). Allows marking individual time slots as available/unavailable to control booking availability.",
  "frontend/src/components/admin/BookingsTab.tsx": "Admin dashboard displaying all bookings (current and past) with details like program, gym, date/time, user info, and payment status. Provides actions to delete bookings, toggle payment status, and view health information disclosures.",
  "frontend/src/components/admin/DonationOptionsTab.tsx": "Admin interface for managing donation/payment methods with CRUD operations. Displays list of donation options with method name and details, using a dialog form for adding and editing entries.",
  "frontend/src/components/admin/GalleryTab.tsx": "Admin component for managing gallery images with add/delete functionality, file upload with progress tracking, and image display using React Query hooks and ExternalBlob for image handling.",
  "frontend/src/components/admin/GymsTab.tsx": "Admin component for managing gym locations with CRUD operations (add, edit, delete) for gym name, address, and details using React Query hooks and dialog forms.",
  "frontend/src/components/admin/UserProfilesTab.tsx": "Admin component for viewing and managing user profiles with search functionality, displaying user bookings, workout programs, and gym associations, plus extended profile management capabilities.",
  "frontend/src/components/admin/WorkoutProgramsTab.tsx": "Admin component for managing workout programs with CRUD operations, including title, description, and optional image upload with progress tracking using ExternalBlob.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with three items (Body Analysis, Fitness Metrics, Lifestyle Survey) showing active state based on current route.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright year, links to Fitness Metrics and Lifestyle Survey pages, and social media icons for Instagram and Facebook.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, navigation links (Home, Book Session, Admin for admins), authentication button, and user avatar dropdown menu with profile access and logout, including mobile menu support and automatic admin status refetching.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper component rendering Header, main content area with bottom padding for fixed navigation, Footer, BottomNav, and ProfileSetupModal.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for first-time user profile setup with fields for name, about me, contact info, public visibility toggle, and optional avatar upload with progress tracking. Displays only when authenticated user has no existing profile.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options for idle handling and derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API operations including user profiles, workout programs, gyms, bookings, donations, gallery, availability, body analysis, and lifestyle surveys. Manages query caching and invalidation with useQueryClient.",
  "frontend/src/ic-assets.json": "Empty JSON file, likely a placeholder for Internet Computer asset configuration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, accent, destructive, sidebar, charts, etc.).",
  "frontend/src/lib/i18n.tsx": "Empty file, likely a placeholder for internationalization configuration.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AboutMePage.tsx": "Displays coach profile information including profile picture and about me content, with loading skeletons and fallback UI for missing data.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard with tabbed interface for managing workout programs, gyms, bookings, availability, users, donations, gallery, and about me content. Includes authentication and authorization checks.",
  "frontend/src/pages/BodyAnalysisPage.tsx": "Allows authenticated users to upload body images for AI analysis, simulates body type classification (ectomorph/mesomorph/endomorph), and provides body fat percentage, muscle mass estimates, and personalized recommendations.",
  "frontend/src/pages/BookingPage.tsx": "Multi-step booking form for selecting workout programs, gyms, dates, and time slots, with health disclosure acceptance and information collection before proceeding to donation.",
  "frontend/src/pages/DonationPage.tsx": "Displays donation/payment options for a booking, allowing users to select cash or other payment methods, then shows a confirmation screen after completion.",
  "frontend/src/pages/FitnessMetricsPage.tsx": "Calculates and displays BMI and body fat percentage based on user inputs (height, weight, age, gender) with categorized health assessments.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring hero section, benefits of calisthenics, gallery images, and a like button for authenticated users to support the website.",
  "frontend/src/pages/LifestyleSurveyPage.tsx": "Multi-section lifestyle survey collecting data on habits, nutrition, and physical activity, calculating a health score with recommendations and shareable results.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a failure message when payment processing fails, with options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a success confirmation screen after successful payment processing with a button to return home.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page allowing authenticated users to view and edit their profile information including name, about me, contact info, avatar upload, and visibility settings, plus displays bookings and programs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom colors for UI components (sidebar, card, chart, etc.), border radius variables, and accordion animations. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file documenting a health app with AI body analysis features including body type classification (ectomorph/mesomorph/endomorph), body fat percentage, muscle mass estimation, and a bottom navigation bar with Body Analysis, Fitness Metrics, and Lifestyle Survey sections. Contains architectural notes, existing features list with requirement IDs, and version tracking."
}